brew "colima"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "htop"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "pyenv"
brew "starship"
brew "tmux"
brew "tree"
brew "uv"  # Modern Python package manager
brew "zsh"

# Window manager
cask "nikitabobko/tap/aerospace"

# Terminal
cask "ghostty"

# Productivity apps
cask "notion"
cask "obsidian"

cask "font-jetbrains-mono-nerd-font"
