# AWS & Cloud Tools
brew "aws-vault"  # Securely store and access AWS credentials
brew "awscli"     # Official AWS command line interface

# CLI Tools & Utilities
brew "fzf"          # Fuzzy finder for command line
brew "htop"         # Interactive process viewer
brew "tree"         # Display directory structure as a tree
brew "tree-sitter"  # Parser generator tool and incremental parsing library

# Networking & Tunneling
cask "ngrok"  # Secure tunneling to localhost

# Container & Virtualization
brew "colima"          # Container runtime on macOS (Docker alternative)
brew "docker"          # Container platform
brew "docker-compose"  # Multi-container Docker applications

# Development Tools
brew "neovim"   # Modern Vim-based text editor
brew "node"     # JavaScript runtime
brew "pyenv"    # Python version management
brew "uv"       # Modern, fast Python package manager (replaces pip/poetry)

# Shell & Terminal
brew "starship"  # Cross-shell prompt customization
brew "tmux"      # Terminal multiplexer for managing multiple sessions
brew "zsh"       # Z shell - modern shell with powerful features

# Dotfile Management
brew "stow"  # Symlink farm manager for dotfiles

# Window Management
cask "nikitabobko/tap/aerospace"  # Tiling window manager for macOS

# Terminal Emulator
cask "ghostty"  # Fast, native terminal emulator

# Productivity Apps
cask "notion"    # All-in-one workspace for notes and collaboration
cask "obsidian"  # Knowledge base and note-taking with markdown

# Fonts
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons

# Themes
# Catppuccin - Pastel color scheme for various applications
# Install via: https://github.com/catppuccin/catppuccin
# Available for: nvim, tmux, ghostty, zsh, and more
