tap "nakabonne/ali"
brew "colima"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "git-lfs"
brew "go"
brew "htop"
brew "hugo"
brew "jpeg"
brew "libomp"
brew "neovim"
brew "node"
brew "pyenv"
brew "xz"
brew "python@3.13", link: false
brew "python@3.9"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wrk"
brew "zlib"
brew "zsh"
brew "nakabonne/ali/ali"
cask "font-jetbrains-mono-nerd-font"
vscode "docker.docker"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "tomoki1207.pdf"
